{"modelTopology":{"class_name":"Model","config":{"name":"model1","layers":[{"name":"textTokens","class_name":"InputLayer","config":{"batch_input_shape":[null,20],"dtype":"int32","sparse":false,"name":"textTokens"},"inbound_nodes":[]},{"name":"embedding","class_name":"Embedding","config":{"input_dim":30,"output_dim":32,"embeddings_initializer":{"class_name":"RandomUniform","config":{"minval":-0.05,"maxval":0.05,"seed":null}},"embeddings_regularizer":null,"activity_regularizer":null,"embeddings_constraint":null,"mask_zero":true,"input_length":20,"name":"embedding","trainable":true,"batch_input_shape":[null,20]},"inbound_nodes":[[["textTokens",0,0,{}]]]},{"name":"encoder","class_name":"LSTM","config":{"name":"encoder","trainable":true,"units":64,"activation":"tanh","recurrent_activation":"hard_sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"recurrent_initializer":{"class_name":"Orthogonal","config":{"gain":1,"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"unit_forget_bias":null,"kernel_regularizer":null,"recurrent_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"recurrent_constraint":null,"bias_constraint":null,"dropout":0,"recurrent_dropout":0,"implementation":null,"return_sequences":false,"return_state":false,"go_backwards":false,"stateful":false,"unroll":false},"inbound_nodes":[[["embedding",0,0,{}]]]},{"name":"typeHead","class_name":"Dense","config":{"units":2,"activation":"softmax","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"typeHead","trainable":true},"inbound_nodes":[[["encoder",0,0,{}]]]},{"name":"colorHead","class_name":"Dense","config":{"units":5,"activation":"softmax","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"colorHead","trainable":true},"inbound_nodes":[[["encoder",0,0,{}]]]},{"name":"sizeHead","class_name":"Dense","config":{"units":3,"activation":"softplus","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"sizeHead","trainable":true},"inbound_nodes":[[["encoder",0,0,{}]]]},{"name":"radiusHead","class_name":"Dense","config":{"units":1,"activation":"softplus","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"radiusHead","trainable":true},"inbound_nodes":[[["encoder",0,0,{}]]]},{"name":"posHead","class_name":"Dense","config":{"units":3,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"posHead","trainable":true},"inbound_nodes":[[["encoder",0,0,{}]]]}],"input_layers":[["textTokens",0,0]],"output_layers":[["typeHead",0,0],["colorHead",0,0],["sizeHead",0,0],["radiusHead",0,0],["posHead",0,0]]},"keras_version":"tfjs-layers 4.22.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"embedding/embeddings","shape":[30,32],"dtype":"float32"},{"name":"encoder/kernel","shape":[32,256],"dtype":"float32"},{"name":"encoder/recurrent_kernel","shape":[64,256],"dtype":"float32"},{"name":"encoder/bias","shape":[256],"dtype":"float32"},{"name":"typeHead/kernel","shape":[64,2],"dtype":"float32"},{"name":"typeHead/bias","shape":[2],"dtype":"float32"},{"name":"colorHead/kernel","shape":[64,5],"dtype":"float32"},{"name":"colorHead/bias","shape":[5],"dtype":"float32"},{"name":"sizeHead/kernel","shape":[64,3],"dtype":"float32"},{"name":"sizeHead/bias","shape":[3],"dtype":"float32"},{"name":"radiusHead/kernel","shape":[64,1],"dtype":"float32"},{"name":"radiusHead/bias","shape":[1],"dtype":"float32"},{"name":"posHead/kernel","shape":[64,3],"dtype":"float32"},{"name":"posHead/bias","shape":[3],"dtype":"float32"}]}],"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v4.22.0","convertedBy":null}