{
  "welcome": "Ласкаво просимо",
  "hello_user": "Привіт, {{name}}!",
  "date_format": "D MMMM YYYY [о] HH:mm",
  "combobox_placeholder": "Введи або обери...",
  "not_data": "Дані відсутні",
  "copy": "Скопіювати",
  "copied": "Скопійовано",
  "health": "Здоров'я",
  "finance": "Фінанси",
  "emotions": "Емоції",
  "relationships": "Відносини",
  "career": "Кар'єра",
  "spirituality": "Духовність",
  "personal_growth": "Особистісний розвиток",
  "hobbies": "Хобі",
  "leisure": "Відпочинок",
  "pickDate": "Оберіть дату",
  "cubic_worlds_game": {
    "pause": {
      "title": "Пауза",
      "description": "Гра на паузі. Натисніть кнопку, щоб продовжити.",
      "resume": "Продовжити"
    },
    "portfolio": {
      "title": "Натисніть <span>F</span> щоб увійти у Портфоліо",
      "description": "Досліджуйте мої проекти та роботи.",
      "main_section": {
        "name": "Костянтин Абрамкін",
        "description": "Я створюю інтерактивні 3D-додатки в Інтернеті.",
        "scroll_down_text": "Прокрутіть, щоб дослідити будинок ↓",
        "subtitle": "Початок — це завжди момент найтоншої рівноваги. Кожен майстер вебу знає це. Щоб вивчати шлях <b>Веб-Розробника</b>, спершу розташуй його у послідовності: <mono>HTML</mono>, <mono>CSS</mono>, <mono>JavaScript</mono>, а далі будуй інтерактивні світи та тривимірні історії. Розташуй його у просторі: Всесвіт вебу, де кожна лінія коду — мовби детектив, куди тебе заведе твоя фантазія. Та не дай себе звести в оману думкою, що твої роки минули і ти чогось не навчився у школі — просто дій. І тоді ти знаходиш справжнє озброєння: <tech>React</tech>, <tech>Node.js</tech> та <tech>Three.js</tech>; світ інтерактивних карт із <tech>Mapbox</tech>; анімації від <tech>Framer Motion</tech> чи <tech>GSAP</tech>. І сучасна Мережа постає живим світом, у якому архітектор — <em>саме ти</em>.",
        "start_text": {
          "1": "Привіт. Це мій сайт-портфоліо. Тут я хочу провести тебе стежкою, якою йшов сам — від дитячої любові до ігор до світу, де фантазія стає реальністю.",
          "2": "У ті роки мене захоплювали RPG на кшталт Diablo, стратегії Total War, світи GTA San Andreas. Я був закоханий у них і дякував Богові, що вони давали мені змогу проживати власні історії — ті, що народжувались із книжок і дитячих дворів.",
          "3": "Але не лише ігри живили мою уяву. Поруч із ними завжди були книги Карлоса Кастанеди, шкільна фізика та університетська наука. Там я відкривав для себе іншу магію — сучасну, у вигляді квантової механіки та таємниць світу, які здавалися майже містичними.",
          "4": "Проте тоді ці сфери існували для мене в різних вимірах: одне було грою, інше — знанням. І був момент, коли я почав сходити зі шляху, шукаючи відповідь у темних провулках життя. Та після університету я зрозумів — можливо запізно, а можливо саме вчасно — що обидві ці стихії можна поєднати. Ключем стало програмування.",
          "5": "Відтоді я вже не лише грав, читав і мріяв. Я почав творити світи. Це було близько десяти років тому, у 2015-му. Тоді, працюючи звичайним робітником на заводі, я ночами занурювався в код, навчаючись самотужки. Це була виснажлива подорож, адже до того я майже нічого не знав про програмування.",
          "6": "Та пройшло півтора року — і я здобув свою першу роботу веброзробником у аутсорсинговій компанії Computools. І з того моменту мене закрутило у вирі справжньої подорожі."
        },
        "role": {
          "1": "3D/GIS",
          "2": "Web Розробник"
        },
        "skills": {
          "web_developer": "Web Developer",
          "react": "React",
          "maps": "Maps",
          "three_js": "Three.js",
          "webgl": "WebGL",
          "r3f": "R3F",
          "animations": "Animations",
          "gamedev": "GameDev"
        },
        "scroll_down": "Прокрутити вниз"
      },
      "skills_section": {
        "title": "Навички",
        "3d": "<p>3D-моделюванням я займаюсь уже давно, спершу це було радше хобі. Проте останнім часом я все більше занурився у навчання та практику, щоб втілювати власні фантазії. На курсі CGBoost <em>Cubic Worlds</em> та в кількох уроках на Udemy я здобув реальні навички: <strong>моделювання середовищ</strong>,  <strong>створення базових шейдерів</strong>,  <strong>анімація </strong>,  <strong>ріґ персонажів</strong> та багато іншого.</p><p>Саме зараз я відчуваю, що у цій сфері майже немає нічого неможливого для мене — потрібні лише час і хороша ідея.</p><p>У своєму блозі я підготував повноцінні статті з покроковими інструкціями з моделювання <em>Cubic Worlds</em> — від перших кроків до створення повноцінних 3D-сцен. Запрошую ознайомитися тут: <a>Мій блог про Cubic Worlds</a>.</p>",
        "three_js": "<p>Понад <em>4 роки</em> я занурююся в теорію та практику з <strong>Three.js</strong>. Найбільше користі мені принесли курси <a_simon>Simon Bruno – Journey to Three.js</a_simon> та унікальні матеріали від <a_sensei>WawaSensei</a_sensei> (як публічні на YouTube, так і приватні), які охопили безліч прийомів та підходів у створенні 3D-додатків.</p><p>Я також поглиблював знання в низькорівневому <strong>WebGL</strong> та експериментував із шейдерами, що досі здаються мені певною магією. Окремий інтерес займає робота з фізикою: досвід з <strong>Rapier</strong>, а також <strong>Cannon.js</strong> та <strong>Ammo.js</strong>.</p> <p>Найбільшим відкриттям стало знайомство з <strong>React Three Fiber</strong> та <strong>React Drei</strong> — інструментами, що значно спрощують побудову 3D-сцен у <strong>React</strong> і дозволяють швидко експериментувати. За цей час я створив чимало пет-проєктів та експериментів, і з практики зрозумів, що мене найбільше захоплює створення 3D-просторів та ігор.</p><p>Я також пробував <strong>Unity</strong> та <strong>Babylon.js</strong>, але любов до JavaScript та легкість роботи з <strong>React Three Fiber</strong> завжди повертала мене назад. Вірю, що у web-іграх та інтерактивних 3D-досвідах ще величезне майбутнє.</p><a>А ось тут ви можете познайомитися з моїми останніми прикладами на <strong>Three.js</strong>.</a>",
        "three_js_examples": "Попередні роботи з інших сайтів, що не представлені тут",
        "backend_data": "<p>З <strong>Node.js</strong> працюю практично від початку кар’єри у фронтенді. Створюю легкі backend-сервіси й <strong>API</strong>, налаштовую зберігання та доступ до даних у різних СУБД — від документних (<strong>MongoDB/JSON</strong>) до реляційних (<strong>SQL</strong>). Хоч бекенд не є моїм основним фокусом, беру ці задачі на себе, коли немає кому делегувати. На фронті маю сильний практичний досвід кешування та офлайн-режиму: активно використовую <strong>IndexedDB</strong> (у поєднанні з <strong>service workers</strong>), тож застосунок може працювати автономно за умови коректно налаштованої синхронізації. Для керування станом маю великий досвід із <strong>RxJS</strong> в <strong>Angular</strong> та <strong>Redux</strong> в <strong>Angular</strong> і <strong>React</strong>, однак у екосистемі <strong>React</strong> віддаю перевагу <strong>Zustand</strong> за простоту та достатність для 100% моїх кейсів (<strong>Redux</strong> використовую там, де це дійсно виправдано).</p>",
        "visual_data": "<p>Маю значний досвід у візуалізації великих наборів даних (<em>8 000+ записів</em>) у вигляді інтерактивних графіків і таблиць. Основний інструмент — <strong>D3.js</strong>: реалізовував <em>синхронізацію кількох графіків</em>, <em>масштабування/зум</em>, <em>тултіпи/попапи</em>, <em>кастомні іконки</em>, <em>анімації</em>, <em>лінійні</em> та <em>кругові діаграми</em>. Працював і з іншими бібліотеками, однак вважаю <strong>D3.js</strong> найкращим вибором: він не прив’язує до певного стилю і дає повну свободу у фічах, хоча може вимагати більше зусиль у реалізації.</p><p>Для таблиць переважно використовую <strong>AG Grid</strong> — <em>відмінна документація</em>, <em>широкий набір можливостей</em>, <em>підтримка Angular/React/Vanilla JS/TS</em>, просте <em>інтегрування власних компонентів</em>. Реалізовував <em>сортування</em>, <em>drag-and-drop</em>, <em>кастомні фільтри</em> тощо. За допомогою <strong>AG Grid</strong> відображав дані приблизно про <em>8 тис. полів</em> і <em>двобічно синхронізував виділення та пошук із мапою</em> — усе працювало швидко та стабільно.</p>",
        "front_end": "<p>Із <strong>JavaScript</strong> «одружений» уже дев’ять років — і жодного разу не пошкодував про вибір. До цього експериментував із <strong>Java</strong>, <strong>PHP</strong>, <strong>C++</strong>, <strong>C#</strong>, <strong>Python</strong> та щоразу впирався у відчуття прив’язаності до платформи чи конкретних фіч. <strong>JavaScript</strong> дав те, чого бракувало, — свободу: у будь-який момент можна змінити напрям без повного перезавантаження — <em>Frontend</em>, <em>Backend</em>, <em>GameDev</em>, <em>ML/машинне навчання</em>, <em>Mobile</em>, <em>Desktop</em>, <em>Arduino/робототехніка</em>.</p><p>Так, є компроміси — подекуди <strong>JS</strong> поступається продуктивності мовам із компіляцією, — але екосистема стрімко закриває більшість задач. Тут мене страхує<strong>TypeScript</strong> — друга професійна «любов»: із ним код прозорий і передбачуваний (тип <em>any</em> тепер хіба що у кошмарах), а масштабування значно простіше.</p><p>Працював по кілька років із <strong>Vue</strong>, <strong>Angular</strong> та <strong>React</strong>; нині базовий вибір — <strong>React</strong>. У парі з <strong>TypeScript</strong> цей стек дозволяє проєктувати надійні, масштабовані системи — від <em>UI</em> до складної клієнтської логіки та інтеграцій із бекендом.</p>",
        "ui": "<p>Коли я прийшов у веб, ринок жорстко тримав <strong>Bootstrap</strong>. Я не розумів, чому саме він: так, до появи <em>flexbox</em> у нього була зручна сітка, але дизайн здавався мені застарілим. До того ж для будь-яких відхилень доводилося ставити «костилі», бо гнучкого API тоді ще не було.</p><p>Згодом з’явився <strong>Material Design</strong> — візуально приємніший, але кастомізувати його було ще складніше, ніж <strong>Bootstrap</strong>.</p><p>Останніми роками на сцену вийшов <strong>Tailwind</strong> — саме те, чого бракувало: він не нав’язує стилю, повністю кастомізується, добре оптимізований для бандлів і відчутно спрощує розробку. З <strong>Tailwind</strong> я рідше пишу «чистий» <em>CSS</em> — більшість роблю утилітарними класами безпосередньо в розмітці.</p><p>На базі <strong>Tailwind</strong> з’явилося багато UI-бібліотек; одна з улюблених за простоту — <strong>shadcn/ui</strong>. Загалом маю <em>значний досвід роботи</em> з <strong>Bootstrap</strong>, <strong>Material<.strong> та <strong>Tailwind</strong>.</p>",
        "map": "<p>З <em>мапами</em> я повноцінно працюю вже <em>4–5 років</em>. Мій перший реальний досвід почався у компанії <em>Кернел</em>. Спершу я навіть не думав, що ця сфера мені настільки сподобається, але після того, як вирішив кілька складних задач, пов’язаних із підрахунком загальної геометрії для кількох полігонів (по суті, алгоритм <em>convexHull</em>, про який тоді я ще навіть не знав) — мене буквально «затягнуло». Я міг їхати в тролейбусі та на запітнілому вікні малювати й продумувати алгоритми. Це було неймовірно цікаво.</p><p>Ми використовували <strong>ArcGIS</strong>, адже компанія вже багато років будувала рішення саме на цій платформі, і вибору особливо не було. Нашим головним викликом було відобразити <em>8 000 полів</em> швидко та без затримок. По суті, ми створювали щось дуже схоже на <em>Cropio</em>. Через два роки, коли вже було зроблено чимало, я все ж переконав колег перейти на <strong>Mapbox</strong>. Саме він дав нам швидкість та інтерактивність, яких так бракувало. Проте у <strong>Mapbox</strong> не вистачало можливостей <strong>ArcGIS</strong>, зокрема <em>растрових функцій</em>, тому моїм завданням стало поєднати обидві технології. І ми впоралися з цим на відмінно.</p><p>Зараз маю глибокий досвід як з <strong>Mapbox</strong>, так і з <strong>ArcGIS</strong>, хоча перевагу віддаю саме <strong>Mapbox</strong> — за його легкість і надійність. Добре розумію роботу з <em>Mapbox expressions</em>, вмію інтегрувати дані з <strong>OpenStreetMap</strong>, <strong>ArcGIS</strong> та додавати <em>3D-об’єкти</em> на карту.</p><p>У власних pet-проєктах я рідко використовую карти — ідей для веб-застосунків не так багато, а реалізації здебільшого залишаються поверхневими. Але коли працюю з мапами у рамках реальних задач, це мене захоплює так само, як колись у дитинстві захоплювали ігри <em>Total War</em> чи книги про мореплавців — <em>Френсіса Дрейка</em>, <em>Джеймса Кука</em> або ж <em>Магеллана</em>. Під час розробки мап я почуваюся то піратом, то першовідкривачем.</p>",
        "map_content": {
          "title": "Деякі з моїх проєктів із мапами",
          "population_project": "Проєкт із візуації населення України",
          "3d_buildings_project": "Можливість додавання 3D-будівель на карту"
        }
      },
      "experience": {
        "title": "Досвід",
        "kernel": "<ul><h5>У компанії <em>Kernel</em> я пропрацював 5 років, де з нуля розробив два повноцінних веб-додатки:</h5><li>загальна інтерактивна мапа всіх полів за кластерами (понад 8 000 полігонів);</li><li>система детальної аналітики по конкретному полю.</li></ul> <ul><h5>У проєктах ми поєднували:</h5> <li><strong>Mapbox</strong> — для відображення геометрії та інтерактивної графіки;</li> <li><strong>ArcGIS</strong> — для роботи з растровими даними: <em>NDVI-знімки</em>, <em>ґрунтові тайли</em>, <em>треки нарядів</em>.</li></ul> <ul><h5>Функціонал охоплював:</h5><li> аналітику по кожному полю;</li> <li>обчислення та обробку полігонів (навіть намальованих вручну);</li> <li>порівняння ключових показників;</li> <li>комплексні агроаналітичні інструменти для агрономів.</li></ul> <h5>Технології: <strong>Angular 2+</strong>, <strong>D3.js</strong>, <strong>Turf.js</strong>, <strong>ArcGIS</strong>, <strong>Mapbox</strong>, <strong>AgGrid</strong>, <strong>Material UI</strong>.</h5> <side_line>На жаль, я не можу надати жодної візуальної інформації чи лінків, оскільки проєкт був закритим внутрішнім рішенням для працівників компанії, і я підписав контракт про нерозголошення інформації (NDA). Проте, якщо описати коротко — це була повноцінна альтернатива Cropio: у чомусь менш масштабна, але водночас більш інноваційна в окремих рішеннях.</side_line>",
        "u_studio": "<p>В <em>Ustudio</em> працюю останні два роки. З нуля самостійно розробив фронтенд-частину застосунку для відображення зруйнованих та відбудованих об’єктів під час війни в Україні. Реалізовано теплову мапу рівня профінансованості та потреб, фільтри за типами об’єктів, аналітичні діаграми й детальні картки кожного об’єкта. Використані інструменти: <strong>React</strong>, <strong>Node.js</strong> (кешування та обробка даних), <strong>Mapbox</strong>, <strong>Material UI</strong>, <strong>Tailwind CSS</strong>, <strong>Redux</strong>, <strong>D3.js</strong>, <strong>Framer Motion</strong>, <strong>IndexedDB</strong> (кеш на фронтенді). <a>Посилання на проєкт</a>.</p>",
        "ixlayer": "<ul><h5>В <em>ixlayer</em> працював віддалено понад два роки.</h5><li>Розробляв веб-сайти на <strong>Vue.js</strong> для сервісів генетичного ДНК-тестування.</li><li>Основний фокус — <em>landing pages</em>, <em>форми реєстрації</em> та <em>анкети/бланки</em> для заповнення.</li></ul><h5>Технології: <strong>Vue.js</strong>.</h5>",
        "computools": "<p>Першою компанією, де я почав працювати розробником веб-сайтів, була <em>Computools</em>. Мої основні обов’язки — створення інтерактивних, анімованих сайтів із використанням <strong>HTML</strong>, <strong>SCSS</strong>, <strong>JavaScript</strong>, <strong>Bootstrap</strong>, а також перший практичний досвід з <strong>Angular 2</strong>.</p>",
        "about_game": "<p>Друже, якщо ти дістався цієї секції — ми вже на одній хвилі. Я дійшов до стану, коли знаю достатньо, щоб втілювати свою мрію. <strong>Cubic Worlds Game</strong> — моя перша офіційна гра, яку планую розвивати найближчими місяцями, а можливо й роками, доки вона не стане повноцінним проєктом.</p><p>У <strong>Cubic Worlds</strong> я будую не просто гру, а цілий світ: ти зможеш захищати селище від навали скелетів і зомбі; збирати зілля та настоянки; відкривати магічні здібності, читаючи чарівні книги; перевтілюватися у різні види тварин і птахів. Знаходь і колекціонуй зброю (мечі, рушниці, посохи), одяг і предмети, зберігай їх у власній оселі та продавай на ринку. У подорожах зустрінеш друзів і ворогів, які або допомагатимуть, або перешкоджатимуть. У планах — кімнати для онлайн-гри з друзями чи випадковими гравцями, а також різні види транспорту: машини, роботи, літаки, гелікоптери (залежно від світу).</p><p>Головна ідея — не лише проходити квести, а й навчатися. Залежно від кімнати гра пояснюватиме наукові підходи, фізику, математику, англійську, логіку, алгоритми, програмування, історію тощо — щоб гра була і цікавою, і корисною.</p><p><em>Що вже зроблено</em>: <em>базовий контролер персонажа</em>; <em>редактор світу</em> (можна «малювати» траву, ґрунт та інші об’єкти відносно поверхонь); <em>додавання окремих предметів і фізики</em>; <em>збереження, прив’язане до користувача</em>; <em>персонаж уміє завдавати перші удари та розбивати ящики</em>. Далі в планах: <em>вороги</em>, <em>дроп предметів</em> та <em>інші механіки</em>.</p><p>Плануєш побудувати свій світ? Тоді тобі <a>сюди</a>.</p><p>Якщо хочеш підтримати розробку чи маєш цікавий проєкт для мене або ж прагнеш до взаємодії — напиши. Буду радий співпраці, ідеям та фідбеку. Нижче прикріплю посилання на мої соцмережі та Patreon. Дякую за увагу — побачимось! 😊</p>",
        "cubic_worlds_game": {
          "title": "Можливості Cubic Worlds Game",
          "scatter_draw": "Додавати 3D обʼєкти малюючи по поверхні",
          "single_draw": "Додавати 3D обʼєкти кліком по поверхні",
          "edit": "Режим редагування світу",
          "physcis": "Увімкнути фізику для обʼєктів",
          "explore": "Режим дослідження світу"
        }
      }
    }
  },
  "months": [
    "Січень",
    "Лютий",
    "Березень",
    "Квітень",
    "Травень",
    "Червень",
    "Липень",
    "Серпень",
    "Вересень",
    "Жовтень",
    "Листопад",
    "Грудень"
  ],
  "ranges": {
    "today": "Сьогодні",
    "yesterday": "Вчора",
    "thisWeek": "Цього тижня",
    "lastWeek": "Минулого тижня",
    "last7Days": "Останні 7 днів",
    "thisMonth": "Цього місяця",
    "lastMonth": "Минулого місяця",
    "thisYear": "Цього року",
    "lastYear": "Минулого року"
  },
  "pages": {
    "home": "Головна",
    "blog": "Блог",
    "task-manager": "Менеджер завдань",
    "labs": "Майстерня",
    "task": {
      "template": "Шаблон задачі",
      "daily": "Щоденні завдання",
      "analytics": "Аналітика"
    }
  },
  "labs": {
    "title": "Протоколи досліджень і розробок",
    "system_status_description": "Збірка WEBGL-експериментів, тестів продуктивності та взаємодії шейдерів.",
    "system_status": "Статус системи: Експериментальний",
    "system_status_description_bold": "Увага: Очікується висока навантаження на GPU."
  },
  "portfolio": {
    "coord": "КООРДИНАТИ: 48.9226° N, 24.7111° E",
    "sys_ver": "ВЕРСІЯ СИСТЕМИ: {{app_version}}",
    "name": "Костянтин Абрамкін",
    "title": "DIGITAL <br /> ARCHITECT",
    "description": "Перетворюю мільйони точок даних на інтерактивні 3D веб-проєкти. Спеціалізуюся на WebGL, React Three Fiber та високопродуктивних картографічних системах.",
    "view_dossier": "Переглянути Портфоліо",
    "contact": "Зв'язатися",
    "status_work": {
      "busy": "Зайнятий проєктами",
      "available": "Доступний для проєктів"
    },
    "contact_modal": {
      "title": "Зв'язатися",
      "description": "Давайте обговоримо ваш наступний проєкт.",
      "first_name": "Ім'я",
      "first_name_placeholder": "Іван",
      "last_name": "Прізвище",
      "last_name_placeholder": "Петренко",
      "email": "Електронна пошта",
      "email_placeholder": "example@example.com",
      "message": "Повідомлення",
      "message_placeholder": "Опишіть ваш проєкт детально",
      "avg_response": "Середній час відповіді: 24 год",
      "send": "Відправити",
      "error": "Помилка",
      "error_message": "Виникла помилка при відправленні повідомлення. Будь ласка, спробуйте ще раз.",
      "success": "Повідомлення відправлено успішно",
      "success_message": "Ваше повідомлення було відправлено успішно. Я зв'яжуся з вами як тільки зможу.",
      "close": "Закрити"
    },
    "tech_stack": {
      "title": "Арсенал"
    },
    "experience": {
      "title": "Шлях Розробника (8 років)",
      "u_studio": {
        "status": "Поточний проект",
        "description": "Розробка національної платформи відновлення. Візуалізація зруйнованих об'єктів на мапі, інтеграція даних інвесторів. Складні дашборди з React та Mapbox."
      },
      "cubic_worlds_game": {
        "status": "GameDev & R&D",
        "description": "Створння власної RPG гри у браузері. React Three Fiber, фізичні двіжки, шейдери. Кешування ассетів через IndexedDB для performance."
      },
      "kernel": {
        "status": "AgroTech Digitalization",
        "title": "Kernel - Агро-аналітика",
        "description": "Діджиталізація полів: 8000+ полігонів, аналіз ґрунтів та трекінг техніки. Розробка високонавантажених карт з TableGrid та кастомних шарів."
      },
      "ixlayer": {
        "status": "HealthTech",
        "title": "ixLayer - ДНК-генетична платформа",
        "description": "Розробка інтерфейсів для ДНК-генетичних тестів. Vue.js компоненти, інтеграція медичних API. Візуалізація результатів тестування та оптимізація медичних робочих процесів."
      },
      "computools": {
        "status": "Frontend Engineering",
        "description": "Розробка веб-інтерфейсів на HTML, CSS, JS. Перехід до створення SPA на Angular та TypeScript. Оптимізація UI/UX, робота в Agile-команді."
      }
    }
  },
  "login": {
    "status": {
      "title": "Статус",
      "online": "В мережі",
      "offline": "Не в мережі"
    },
    "to_google": "Увійти через Google",
    "out": "Вийти",
    "switch": "Увійти в інший обліковий запис"
  },
  "blog": {
    "topics": {
      "all": "Усі розділи",
      "all_subtopics": "Усі підрозділи"
    },
    "subtopics": {
      "common": "Загальні"
    },

    "articles": {
      "on_this_page": "На цій сторінці"
    }
  },
  "chart": {
    "hours": "Години",
    "days": "Дні",
    "hour": "год",
    "minute": "хв",
    "count_chart_title": "Сумарна тривалість задач кожного дня",
    "period_count_category_title": "Сумарна тривалість категорій за період",
    "period_count_task_title": "Сумарна тривалість задач за період",
    "range_count_task_title": "Аналатіка витраченого часу на задачі за обраний період",
    "period": "Період",
    "category": "Категорії",
    "task": "Задачі",
    "timeCount": "Tривалість",
    "task_day_count": "Задачі за сьогодні",
    "pie_category_daily_time": "Статус виконання задач за категоріями",
    "done_tasks": "Зроблені задачі",
    "undone_tasks": "Незроблені задачі",
    "line_chart_type": {
      "title": "Тип лінії",
      "linear": "Лінійна",
      "step": "Крокова",
      "smooth": "Плавна",
      "smooth_cardinal": "Плавна (Cardinal)",
      "monotone": "Монотонна"
    }
  },

  "task_manager": {
    "add": "Додати завдання",
    "category": "Категорія",
    "template_task": "Шаблони завдань",
    "template_daily_task_title": "Шаблон завдань на кожен день",
    "daily_task_title": "Твої завдання за",
    "new_task": "Нові завдання",
    "add_template_task": "Додати шаблони завдань за сьогодні",
    "add_container": "Додати категорію",
    "planned_tasks": "Заплановані завдання",
    "drag_task_here": "Перетягни сюди задачу",
    "edit": "Редагувати завдання",
    "delete": "Видалити завдання",
    "complete": "Завершити завдання",
    "incomplete": "Незавершене завдання",
    "completed": "Завершені завдання",
    "incomplete_tasks": "Незавершені завдання",
    "no_tasks": "Немає доступних завдань",
    "task_name": "Назва завдання",
    "task_description": "Опис завдання",
    "calendar": {
      "header": {
        "title": "Ціль руху",
        "description": "Встановіть вашу щоденну ціль активності."
      }
    },
    "add_all_tasks": {
      "header": {
        "title": "Всі завдання із шаблону",
        "description": "Ви можете додати всі завдання з шаблону до свого списку завдань."
      }
    },
    "analytics": {
      "header": {
        "title": "Аналітика завдань",
        "description": "Тут ти можеш переглянути статистику по постановленим завданням."
      },
      "daily_table": {
        "indicator": "Показник",
        "count": "Кількість",
        "time": "Час"
      },
      "header_range": {
        "title": "Аналітика задач які є за період",
        "description": "Вибери період, за який ти хочеш переглянути статистику по завданням."
      },
      "range_table": {
        "task": "Завдання",
        "done": "Виконано",
        "not_done": "Не виконано",
        "total_time": "Загальний час",
        "done_time": "Час виконання",
        "sort_by_done_time": "Сортувати за часом виконання",
        "sort_by_done_count": "Сортувати за кількістю виконань"
      }
    },
    "day_names": {
      "1": "Пн",
      "2": "Вт",
      "3": "Ср",
      "4": "Чт",
      "5": "Пт",
      "6": "Сб",
      "7": "Нд",
      "all": "Всі можливі задачі",
      "by_all_week": "За всі дні тижня"
    },
    "dialog_category": {
      "delete": {
        "title": "Видалити категорію",
        "description": "Ви впевнені, що хочете видалити цю категорію? Всі завдання в ній будуть видалені.",
        "yes": "Так, видалити",
        "no": "Ні, залишити"
      }
    },
    "dialog_delete_task": {
      "title": "Видалити завдання",
      "description": "Ви впевнені, що хочете видалити це завдання? Воно буде видалено назавжди.",
      "yes": "Так, видалити",
      "no": "Ні, залишити"
    },
    "dialog_create_task": {
      "task": {
        "title": {
          "label": "Назва задачі",
          "description": "Коротко опиши, що ти хочеш зробити."
        },
        "time": {
          "determined": {
            "label": "Заплановано на",
            "description": "Вкажи точний час, коли ти хочеш виконати цю задачу."
          },
          "duration": {
            "label": "Очікувана тривалість",
            "description": "Скільки часу, приблизно, займе ця задача (наприклад, 1 година 30 хвилин)"
          },
          "wasted": {
            "label": "Витрачено часу",
            "description": "Скільки часу фактично було витрачено на виконання (наприклад, 45 хвилин)"
          },
          "label": "Запланований час",
          "wasted_time": "Витрачений час",
          "remaining_time": "Залишилось часу",
          "when_day": "Коли виконувати задачу?",
          "count_time": "Скільки часу потрібно?",
          "hours": "Години",
          "minutes": "Хвилини",
          "on_time": "На цю годину",
          "is_determined_task": "В конректний час",
          "description": "Скільки часу ти хочеш присвятити цій задачі?"
        },
        "priority": {
          "label": "Пріоритет",
          "description": "Наскільки ця задача важлива сьогодні?",
          "options": {
            "low": "Низький",
            "medium": "Середній",
            "high": "Високий"
          }
        }
      },
      "1": {
        "title": "Нова задача",
        "description": "Сформулюй намір на день. Маленький крок — великий вплив."
      },
      "2": {
        "title": "Заплануй важливе",
        "description": "Додай задачу, яка допоможе тобі зосередитись, зберегти баланс і рухатись до цілей."
      },
      "3": {
        "title": "Створити задачу",
        "description": "Вкажи назву, пріоритет і бажаний час виконання. Це допоможе краще організувати день."
      },
      "4": {
        "title": "Головна дія дня",
        "description": "Що сьогодні справді важливо? Опиши це коротко і чітко."
      }
    }
  }
}
